Repository: 84000/data-translation-memory
Catalog: toh216-v3.tmx
Source language: bo
Languages: en

source: དཔེར་ན་ས་ནི་ནམ་མཁའ་ལ་རྟག་པའམ། མི་རྟག་པའམ། བདེ་བའམ། སྡུག་བསྔལ་བའམ། སྡུག་པའམ། མི་སྡུག་པའམ། བདག་གམ། བདག་མེད་པའམ། སེམས་ཅན་ནམ། སེམས་ཅན་མེད་པའམ།
en: Noble sons, to draw another analogy, the earth does not hold any permanence, impermanence, happiness, suffering, beauty, ugliness, self, lack of self, being, lack of being, life force, lack of life force, person, or lack of person in the sky.

source: སྲོག་གམ། སྲོག་མེད་པའམ། གང་ཟག་གམ། གང་ཟག་མེད་པར་མི་འཛིན་ཏོ། །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་གཟུངས་ཀྱང་ཆོས་ཐམས་ཅད་མི་འཛིན་ཏོ།
en: Noble sons, dhāraṇī likewise does not hold any phenomena.

source: རིགས་ཀྱི་བུ་གཟུངས་ནི་གཉིས་དང་བྲལ་བའི་ཕྱིར་རོ།
en: Noble sons, dhāraṇī is free from duality. “

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ས་ནི་ནམ་མཁའ་མི་འཛིན་ཏོ།
en: Noble sons, to draw another analogy, the earth does not hold space.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་གཟུངས་ཀྱང་ཆོས་ཐམས་ཅད་མི་འཛིན་ཏོ།
en: Likewise, Noble sons, dhāraṇī does not hold any phenomena. “

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་སྟོང་པ་ཉིད་ནི་ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་མི་འཛིན་ཏོ།
en: Noble sons, to draw an analogy, emptiness does not hold any types of views.

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་རང་བཞིན་ནི་ཉེ་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་མི་འཛིན་ཏོ།
en: Noble sons, to draw an analogy, the natural state does not hold any subsidary afflictions.

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ལམ་སྐྱོན་མེད་པར་གྱུར་པ་ནི་ཆོས་ཐམས་ཅད་ལ་བྱེད་པ་མེད་འཛིན་པ་མེད་དོ།
en: Noble sons, to draw an analogy, the flawless path does not create or hold any phenomena.

source: །དེ་ལྟ་བས་ན་རིགས་ཀྱི་བུ་དག་གང་གཟུངས་དེ་ནི་མི་ཟད་པའོ།
en: Therefore, noble sons, dhāraṇī is inexhaustible.

source: །གང་མི་ཟད་པ་དེ་ནི་ཚད་མེད་པའོ།
en: What is inexhaustible is limitless.

source: །གང་ཚད་མེད་པ་དེ་ནི་ཀུན་གྱི་རྗེས་སུ་སོང་བའོ།
en: What is limitless reaches everywhere.

source: །གང་ཀུན་གྱི་རྗེས་སུ་སོང་བ་དེ་ནི་ནམ་མཁའི་དབྱིངས་སོ། །དེ་ལྟ་སྟེ།
en: What reaches everywhere is the expanse of space.

source: རིགས་ཀྱི་བུ་དག་ནམ་མཁའི་དབྱིངས་དང་གཟུངས་དེ་གཉིས་ནི་རྣམ་པ་གཉིས་སུ་མེད་དོ།
en: Noble sons, the expanse of space and dhāraṇī are not two different things.”

source: །འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་གཟུངས་འདི་སྟོན་པ་བསྟན་པའི་ཚེ་འཁོར་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱས་གཟུངས་ཐོབ་པར་གྱུར་ཏོ།
en: When Mañjuśrī Kumārabhūta gave this teaching on dhāraṇī, five hundred bodhisattvas attained dhāraṇī.

source: །གཞན་ཡང་ཐུན་དབུ་མ་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་པོ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་རྒྱ་ཆེར་བཤད་དེ།
en: Furthermore, in the middle session, Mañjuśrī Kumārabhūta delivered a detailed Dharma teaching called The Bodhisattva Collection to these five hundred bodhisattvas. “

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ལ་འཇུག་པ་གང་ཞེ་ན།
en: What are entrances to The Bodhisattva Collection?

source: ཆོས་གང་འཇིག་རྟེན་པ་དང་། གང་འཇིག་རྟེན་ལས་འདས་པ་དང་།
en: Within The Bodhisattva Collection there are no phenomena that pertain to the world or the transcendence of the world.

source: ཆོས་གང་འདུས་བྱས་པ་དང་། གང་འདུས་མ་བྱས་པ་དང་།
en: There are no phenomena that are conditioned or unconditioned.

source: ཆོས་གང་དགེ་བ་དང་། གང་མི་དགེ་བ་དང་། གང་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། གང་ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་།
en: There are no phenomena that are virtuous or nonvirtuous. There are no phenomena that are misdeeds or not misdeeds.

source: གང་ཟག་པ་དང་བཅས་པ་དང་། གང་ཟག་པ་མེད་པའི་ཆོས་གང་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་རྗེས་སུ་མ་ཞུགས་པ་མེད་དེ།
en: There are no phenomena that contain a person or the lack of a person.

source: དེ་དག་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་རྗེས་སུ་ཞུགས་སོ།
en: Nevertheless, all these things are contained within The Bodhisattva Collection. “

source: རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ནི་ཆོས་ཐམས་ཅད་རྟོགས་པ་ཡིན་ནོ།
en: Noble sons, The Bodhisattva Collection is the realization of all phenomena.

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་བརྒྱ་དང་། ཉི་མ་དང་ཟླ་བ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། རི་རབ་རིའི་རྒྱལ་པོ་བྱེ་བ་ཕྲག་བརྒྱ་དང་།
en: Noble sons, to draw an analogy, in this great trichiliocosm there are a billion four-continent world systems, a billion suns and a billion moons, a billion Mount Merus, and a billion vast oceans.

source: རྒྱ་མཚོ་མཆིང་རྣམ་ཆེན་པོ་བྱེ་བ་ཕྲག་བརྒྱ་ཡོད་པ་དེ་དག་ཐམས་ཅད་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་འདུས་ཤིང་འུབ་བོ།
en: All these are contained and collected within this great trichiliocosm.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་གང་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་དང་། གང་སློབ་པའི་ཆོས་རྣམས་དང་། གང་སློབ་པ་མེད་པའི་ཆོས་རྣམས་དང་། གང་ཉན་ཐོས་ཀྱི་ཆོས་རྣམས་དང་། གང་རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། གང་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་དང་། གང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་ནང་དུ་འདུས་ཤིང་འུབ་བོ།
en: Likewise, noble sons, the qualities of ordinary beings, the qualities of learning, the qualities beyond learning, the qualities of hearers, the qualities of solitary buddhas, the qualities of bodhisattvas, and the qualities of buddhas are all contained and collected within the Dharma teachings in The Bodhisattva Collection.

source: རིགས་ཀྱི་བུ་དག་ཉན་ཐོས་ཀྱི་ཐེག་པར་བསྡུ་བ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པར་བསྡུ་བ་དང་། ཐེག་པ་ཆེན་པོར་བསྡུ་བ་དང་། ཐེག་པ་ཐམས་ཅད་དུ་འདུས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་སོ།
en: Noble sons, that which is contained in the vehicle of the hearers, in the vehicle of the solitary buddhas, in the Great Vehicle, and in all the other vehicles is found in the Dharma teachings in The Bodhisattva Collection.

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ཤིང་གི་རྩ་བ་བཟུང་བ་ན་ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་ཐམས་ཅད་འདུས་པར་འགྱུར་རོ།
en: Noble sons, to draw an analogy, if one grasps the roots of a tree, that will include all its leaves, flowers, and fruits.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་བཟུང་ན་ཐེག་པ་ཐམས་ཅད་འདུས་པར་འགྱུར་རོ།
en: Likewise, Noble sons, if a bodhisattva great being grasps the Dharma teachings in The Bodhisattva Collection, that will include all the vehicles. “

source: །རིགས་ཀྱི་བུ་དག་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་གང་ཞེ་ན།
en: Well then, noble sons, what is The Bodhisattva Collection?

source: རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཅེས་བྱ་བ་ནི་སྣོད་ཚད་མེད་པ་ཡིན་ནོ།
en: Noble sons, The Bodhisattva Collection is an immeasurable vessel.

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱ་མཚོ་མཆིང་རྣམ་ཆེན་པོ་ཚད་མེད་པའི་ཆུ་ནི་ཀླུ་དང་། ལྷ་མ་ཡིན་དང་། གནོད་སྦྱིན་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པའི་སེམས་ཅན་ཚད་མེད་པ་དག་གི་སྣོད་ཡིན་ནོ།
en: Noble sons, to draw an analogy, the immeasurable water in the vast ocean is the vessel for the limitless beings contained in the realms of nāgas, asuras, yakṣas, and animals.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱང་ཐོས་པ་དང་། ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། ཡེ་ཤེས་མཐོང་བ་ཚད་མེད་པའི་སྣོད་ཡིན་ནོ།
en: Likewise, noble sons, the Dharma teachings in The Bodhisattva Collection are an immeasurable vessel for hearing, discipline, absorption, insight, and wisdom vision.

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་སེམས་ཅན་གང་དག་རྒྱ་མཚོ་མཆིང་རྣམ་ཆེན་པོའི་ནང་དུ་སྐྱེས་པ་ནི་རྒྱ་མཚོ་མཆིང་རྣམ་ཆེན་པོ་མ་གཏོགས་པར་ཆུ་གཞན་རྣམས་མི་འཐུང་ངོ་།
en: Noble sons, to draw an analogy, beings born within the vast ocean never drink any other bodies of water.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་གང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ལ་སྤྱོད་པ་དེ་དག་ནི་ཐམས་ཅད་མཁྱེན་པའི་རོ་མ་གཏོགས་པར་ཆོས་གཞན་གྱི་རོ་མི་འཐུང་སྟེ།
en: Likewise, noble sons, those who engage in the Dharma teachings within The Bodhisattva Collection do not drink any Dharma other than the fluid of omniscience.

source: དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཅེས་བྱའོ།
en: For this reason, it is called The Bodhisattva Collection. “

source: །ཡང་རིགས་ཀྱི་བུ་དག་འདི་གསུམ་ནི་སྡེ་སྣོད་ཡིན་ནོ།
en: Moreover, noble sons, there are three collections.

source: །གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the three?

source: ཉན་ཐོས་ཀྱི་སྡེ་སྣོད་དང་། རང་སངས་རྒྱས་ཀྱི་སྡེ་སྣོད་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་དོ།
en: They are the collection of the hearers, the collection of the solitary buddhas, and the collection of the bodhisattvas.

source: །རིགས་ཀྱི་བུ་དག་དེ་ལ་ཉན་ཐོས་ཀྱི་སྡེ་སྣོད་ནི་ཕ་རོལ་གྱི་སྒྲའི་རྗེས་སུ་འབྲང་བས་ཐོབ་པའོ།
en: Noble sons, the collection of the hearers is attained by following the message of the far shore.

source: །རང་སངས་རྒྱས་ཀྱི་སྡེ་སྣོད་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྟོགས་པའི་ཕྱིར་རྒྱུ་ཟད་པར་རྟོགས་པའོ།
en: In the collection of the solitary buddhas, causes are understood to be exhausted via the realization of dependent origination.

source: །རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ནི་ཆོས་ཚད་མེད་པ་རྟོགས་ཤིང་རང་བྱུང་བའི་ཡེ་ཤེས་དང་འཐུན་པའོ།
en: Noble sons, The Bodhisattva Collection is the realization of immeasurable qualities in accord with self-occurring wisdom.

source: །ཡང་རིགས་ཀྱི་བུ་དག་ཉན་ཐོས་སམ། རང་སངས་རྒྱས་དག་ནི་གང་ཡང་སྡེ་སྣོད་གསུམ་པ་མ་ཡིན་གྱི།
en: Moreover, noble sons, the hearers and solitary buddhas do not in any way belong to the third collection.

source: རིགས་ཀྱི་བུ་དག་གང་གི་ཆོས་བཤད་པ་ལས་སེམས་ཅན་དག་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཐེག་པ་གསུམ་གྱིས་འབྱུང་བ་དེ་ལ་ནི་སྡེ་སྣོད་གསུམ་པའོ་ཞེས་བདག་སྨྲའོ།
en: But, noble sons, the Dharma that is taught occurs through the three vehicles for the sake of those beings who belong to the vehicle of the hearers, the vehicle of the solitary buddhas, and unsurpassed and perfect awakening. This is what I proclaim to be the three collections.

source: །རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་འཆད་ན་སེམས་ཅན་དག་ཐེག་པ་གསུམ་གྱིས་འབྱུང་བས་ན་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྡེ་སྣོད་གསུམ་པ་ཞེས་བྱའོ།
en: Noble sons, when bodhisattvas teach the Dharma, beings are taught according to the three vehicles. Therefore, bodhisattvas are said to possess all three collections. “

source: །རིགས་ཀྱི་བུ་དག་གཞན་ཡང་བསླབ་པ་ནི་གསུམ་མོ།
en: Furthermore, noble sons, the training is threefold.

source: །གསུམ་གང་ཞེ་ན།
en: What are the three parts?

source: ཉན་ཐོས་ཀྱི་བསླབ་པ་དང་། རང་སངས་རྒྱས་ཀྱི་བསླབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པའོ།
en: They are the training of the hearers, the training of the solitary buddhas, and the training of the bodhisattvas.

source: །རིགས་ཀྱི་བུ་དག་དེ་ལ་ཉན་ཐོས་ཀྱི་བསླབ་པ་ནི་ཕྱོགས་གཅིག་པ་བདག་གི་བསམ་པའི་རྒྱུད་སྣང་བའི་མཚན་ཉིད་དོ།
en: Noble sons, in this regard, the training of the hearers is limited to the characteristics that appear in the continuity of their thoughts.

source: །རང་སངས་རྒྱས་ཀྱི་བསླབ་པ་ནི་ནན་ཏན་བར་མ་དང་ལྡན་ཞིང་སྙིང་རྗེ་ཆེན་པོ་དང་བྲལ་བའོ།
en: The training of the solitary buddhas involves a middling degree of earnestness but no great compassion.

source: །རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ནི་ཚད་མེད་པའི་རྗེས་སུ་སོང་བ།
en: Noble sons, the training of the bodhisattvas accords with the immeasurable.

source: སྙིང་རྗེ་ཆེན་པོས་ཟིན་པའོ།
en: It is embraced by great compassion.

source: །ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་གནས་པ་ནི་རང་སངས་རྒྱས་ཀྱི་བསླབ་པ་ལ་མི་སློབ་ཅིང་མི་ཤེས་སོ།
en: Situated in the vehicle of the hearers, one will not train in or understand the training of the solitary buddhas.

source: །རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་གནས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ལ་མི་སློབ་ཅིང་མི་ཤེས་སོ།
en: Situated in the vehicle of the solitary buddhas, one will not train in or understand the trainings of the bodhisattvas.

source: །རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཉན་ཐོས་ཀྱི་བསླབ་པ་ལ་ཡང་སློབ་ཅིང་ཤེས་མོད་ཀྱི་ཉན་ཐོས་ཀྱི་ཐེག་པ་འདོད་པར་ཡང་མི་བྱེད། ཐེག་པ་དེས་འབྱུང་བར་ཡང་མི་བྱེད།
en: Noble sons, though bodhisattvas train in and understand the trainings of the hearers, they do not desire the vehicle of the hearers, nor do they emerge through it.

source: རང་སངས་རྒྱས་ཀྱི་བསླབ་པ་ལ་ཡང་སློབ་ཅིང་ཤེས་མོད་ཀྱི། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་འདོད་པར་ཡང་མི་བྱེད། ཐེག་པ་དེས་འབྱུང་བར་ཡང་མི་བྱེད་དེ།
en: Though they train in and understand the vehicle of the solitary buddhas, they do not desire the vehicle of the solitary buddhas, nor do they emerge through it.

source: བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ལ་སློབ་ཅིང་ཤེས་ལ་ཐེག་པ་ཆེན་པོ་དེས་འབྱུང་བར་བྱེད་དེ།
en: In training in and understanding the training of the bodhisattvas, they emerge through the Great Vehicle.

source: བྱུང་ནས་ཀྱང་ཉན་ཐོས་ཀྱི་རྣམ་པར་གྲོལ་བ་ཡང་སྟོན། རང་སངས་རྒྱས་ཀྱི་རྣམ་པར་གྲོལ་བ་ཡང་སྟོན། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་གྲོལ་བ་ཡང་སྟོན་ཏོ།
en: In doing so, they demonstrate the liberation of hearers, the liberation of solitary buddhas, and the liberation of bodhisattvas. “

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། གང་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ལ་སྤྱོད་པ་དེ་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཅེས་བྱའོ།
en: Noble sons, mastery of the practice of the bodhisattva trainings is The Bodhisattva Collection.

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ནོར་བུ་བཻ་དཱུརྱའི་སྣོད་ཀྱི་ནང་དུ་ཅི་དང་ཅི་བཅུག་པ་དེ་ཐམས་ཅད་དེའི་རང་བཞིན་ཉིད་དུ་འགྱུར་རོ།
en: To draw an analogy, noble sons, anything that one places in a beryl vessel will take on its nature.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་རྗེས་སུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་གང་དང་གང་འཚལ་བ་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་རང་བཞིན་ཉིད་རྗོད་པར་བྱེད་དོ།
en: Likewise, noble sons, any qualities explained by bodhisattva great beings who follow The Bodhisattva Collection are expressed as having the very nature of the qualities of buddhahood.

source: །རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་རྗེས་སུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གང་སངས་རྒྱས་ཀྱི་ཆོས་མ་ཡིན་པ་དེ་དག་མི་མཐོང་ངོ་།
en: Noble sons, bodhisattva great beings who follow The Bodhisattva Collection see nothing that is not a quality of buddhahood.

source: །གང་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་མ་ཡིན་པ་དེ་དག་མི་མཐོང་ངོ་།
en: They see nothing that is not a bodhisattva training.

source: །གང་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ལ་སློབ་པར་བྱ་བ་མ་ཡིན་པའི་ཆོས་དེ་དག་མི་མཐོང་ངོ་།
en: They do not see any quality within the bodhisattva training that should not be trained in.

source: །གང་ཚུལ་བཞིན་མ་ཡིན་པའི་ཆོས་དེ་དག་ཀྱང་མི་མཐོང་སྟེ།
en: They do not see any inappropriate qualities.

source: ཆོས་ཐམས་ཅད་ཚུལ་བཞིན་དུ་མཐོང་བས་ཆོས་གང་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་སུ་མི་རྗོད་པ་མེད་དོ།
en: Since all qualities are seen genuinely, no quality could be described as not a quality of buddhahood.

source: །རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ནི་ཡི་གེས་བཤད་པ་མཐའ་ཡས་ཏེ། ཡི་གེའི་འབྲུ་གཞག་པ་ཚད་མེད་པ་ཡིན་ནོ།
en: Noble sons, The Bodhisattva Collection is a limitless expression by means of letters; it is an immeasurable presentation of linguistic syllables.

source: །སྣང་བས་གསལ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡིན་ནོ།
en: It is an unfathomable illumination.

source: །དེ་ལྟར་མོས་པ་ནི་སེམས་ཅན་རྣམས་ལ་མཉམ་པ་ཉིད་དུ་གཞུག་པའི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་བྱེད་པའོ།
en: Those who relate to it in this way will also rest in sameness toward all beings. Therefore, it causes them to attain omniscient wisdom.

source: །གང་དག་བསླབ་པ་དེ་ལ་སློབ་ཅིང་སློབ་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་འདི་ཉིད་ཀྱི་རྗེས་སུ་ཞུགས་པས་ཐེག་པ་ཆེན་པོ་དེ་རྟོགས་པར་འགྱུར་ཏེ། དེ་ཡང་བྱེད་པ་མེད་པར་རྟོགས་སོ།
en: Anyone who either trains in or will train in such practices will be following this very Bodhisattva Collection. Thus, they will come to realize the Great Vehicle, and they will do so in a manner that is devoid of action.”

source: །དེ་ལྟ་སྟེ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་མཚན་མོའི་ཐུན་བར་མའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རྒྱ་ཆེར་བཤད་དོ།
en: In this way, Mañjuśrī Kumārabhūta expounded in detail the Dharma teaching of The Bodhisattva Collection to these bodhisattvas during the middle watch of the night.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་མཚན་མོ་ཐུན་ཐ་མའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་རྡོ་རྗེའི་ཚིག་ལ་འཇུག་པའི་དོན་རྒྱ་ཆེར་བཤད་པ།
en: Then, during the final watch of the night, Mañjuśrī Kumārabhūta expounded in detail upon the meaning that penetrates the vajra words of the nonregressing wheel. “

source: རིགས་ཀྱི་བུ་དག་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཆོས་འཆད་པ་ལས་སེམས་ཅན་གང་དག་གིས་ཆོས་འཆད་པ་དེ་མཉན་ནས་དེ་དག་ཐམས་ཅད་ཀྱིས་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཉིད་རྟོགས་ཤིང་། ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་བཤད་པ་ལས་སླར་མི་ལྡོག་པའོ།
en: Noble sons, the nonregressing wheel is such that when bodhisattvas teach about it, those who listen to these teachings will all realize the nature of nonregression, and they will not regress from explanations on the nonregressing wheel.

source: །རིགས་ཀྱི་བུ་དག་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་ལ་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་སྣ་ཚོགས་སུ་མི་སྤྱོད། ཆོས་སྣ་ཚོགས་སུ་མི་སྤྱོད། ཐེག་པ་སྣ་ཚོགས་སུ་མི་སྤྱོད། སངས་རྒྱས་ཀྱི་ཞིང་སྣ་ཚོགས་སུ་མི་སྤྱོད། སངས་རྒྱས་སྣ་ཚོགས་སུ་མི་སྤྱོད་ཅིང་།
en: Noble sons, bodhisattva great beings who are inclined to the nonregressing wheel do not engage with multiple beings, multiple doctrines, multiple vehicles, multiple buddha realms, or multiple buddhas.

source: ཆོས་ཐམས་ཅད་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ནི་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་པར་མཐོང་སྟེ།
en: They see the turning of the wheel of all phenomena as engagement with everything.

source: ཆོས་ཀྱི་དབྱིངས་ཐ་དད་པར་ཡང་ཆོས་ཀྱི་འཁོར་ལོ་དེ་མི་བསྐོར་ཏེ།
en: They do not turn the wheel of Dharma by differentiating the realm of phenomena.

source: དེ་བས་ན་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་ཞེས་བྱའོ། །འཁོར་ལོ་དེ་ནི་ཡོངས་སུ་མ་ཆད་པའི་འཁོར་ལོའོ། །གཉིས་སུ་མེད་པའི་འཁོར་ལོའོ། །ཇི་ལྟ་བ་བཞིན་དུ་བརྗོད་པའི་འཁོར་ལོའོ། །རང་བྱུང་བའི་ཡེ་ཤེས་རྟོགས་པའི་འཁོར་ལོའོ།
en: Therefore, this nonregressing wheel is an unceasing wheel, a nondual wheel, a wheel that explains things accurately, and a wheel of realizing self-occurring wisdom.

source: །འཁོར་ལོ་དེ་ནི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་འཁོར་ལོའོ།
en: This wheel is the wheel of the circle of the realm of phenomena.

source: །རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་མཚན་མ་ཐམས་ཅད་ཀྱིས་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་འདི་ལ་མོས་པར་འགྱུར་བ་དང་མོས་པར་བྱེད་པ་དང་།
en: Noble sons, those bodhisattva great beings who have been inclined, who are inclined, or who will be inclined toward this wheel that is free from regressing due to any marks will be liberated by the liberation of the thus-gone ones.

source: མོས་པར་འགྱུར་བ་དེ་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་གྲོལ་བས་རྣམ་པར་གྲོལ་བར་འགྱུར་ཏེ་རྣམ་པར་གྲོལ་བ་ནི་གཉིས་སུ་ཡང་མི་སྟོན་ཏོ།
en: However, their liberation is not taught in dualistic terms.

source: །དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་གྲོལ་བའི་མཚན་ཉིད་གང་ཡིན་པ་ཆོས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་ཀྱང་དེ་ཡིན་ཏེ། དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་གྲོལ་བ་ནི་མཚན་ཉིད་མེད་པའོ།
en: The characteristic of the liberation of the thus-gone ones is the same as the characteristics of all phenomena, for the liberation of the thus-gone ones is free of characteristics.

source: །ཆོས་ཐམས་ཅད་ཀྱང་རྣམ་པར་གྲོལ་བའི་མཚན་ཉིད་དང་བྲལ་བ་ཡིན་ཏེ། ཆོས་གང་མཚན་ཉིད་མེད་པ་དེ་ནི་རྣམ་པར་གྲོལ་བ་ཡང་མེད་མོད་ཀྱི།
en: All phenomena are free from the characteristic of liberation, for any phenomenon that lacks characteristics also lacks liberation.

source: གཉིས་སུ་མེད་པ། སེམས་དང་། ལུས་དང་བྲལ་བ་དེ་ནི་རྣམ་པར་གྲོལ་བའོ།
en: In actual fact, their nonduality and their lack of mind and body is liberation.

source: །གང་སེམས་དང་། གང་ལུས་དེ་ནི་རྣམ་པར་གྲོལ་བར་མི་འགྱུར་རོ།
en: Mind and body cannot be liberated.

source: རྣམ་པར་གྲོལ་བ་དེ་སེམས་དང་ལུས་ཀྱི་རང་བཞིན་ཡིན་པའི་ཕྱིར་རོ།
en: Because liberation is the nature of mind and body.

source: །དེ་ལྟ་བས་ན་ཡེ་ཤེས་དེ་གཞན་ལ་རག་མ་ལས་པའི་ཕྱིར། ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་ཞེས་བྱའོ།
en: Therefore, that wisdom does not rely on anything extraneous, and this is why it is called the nonregressing wheel. “

source: །རིགས་ཀྱི་བུ་དག་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་ནི་སླར་མི་ལྡོག་གོ།
en: Furthermore, noble sons, the nonregressing wheel cannot be reversed.

source: གཟུགས་ནི་གཟུགས་ཀྱི་རང་བཞིན་ལས་མི་ལྡོག་གོ།
en: Form cannot regress from the nature of form.

source: །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་རྣམ་པར་ཤེས་པའི་རང་བཞིན་ལས་མི་ལྡོག་གོ།
en: Likewise, feeling, perception, formations, and consciousness cannot regress from their nature.

source: །རིགས་ཀྱི་བུ་དག་ཆོས་ཐམས་ཅད་ནི་ཆོས་ཀྱི་དབྱིངས་དེ་ལས་མི་ལྡོག་སྟེ།
en: Noble sons, all phenomena cannot regress from the realm of phenomena.

source: ཆོས་ཀྱི་དབྱིངས་དེ་ནི་ཇི་ལྟ་བ་བཞིན་ཡིན་པས་ན་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་ཞེས་བྱའོ།
en: The realm of phenomena—just as it is—is thus called the nonregressing wheel.

source: །འཁོར་ལོ་དེ་ནི་དབུས་སུ་འཇུག་པ་ཡང་མེད་དེ་འཁོར་ལོ་དེ་ནི་ཆད་པ་མེད་པ། རྟག་པ་མེད་པའོ།
en: This wheel is not situated in the center; this wheel is free from disruption and permanence.

source: །དེ་ལ་ནི་སྒོ་ཆུང་ཟད་ཀྱང་མེད་དེ། དེ་ནི་གཉིས་སུ་མེད་པའི་སྒོའི་འཁོར་ལོའོ།
en: There is not even the smallest gateway into this, for this is a wheel with a nondual gateway.

source: །འཁོར་ལོ་དེ་ནི་སྐོར་བ་མེད་དེ། མི་སྐོར་བའི་འཁོར་ལོའོ།
en: This wheel is not turned, for it is an unturnable wheel.

source: །འཁོར་ལོ་དེ་ནི་སྟོན་པ་ཆུང་ཟད་ཀྱང་མེད་དེ་མི་རྗོད་པའི་འཁོར་ལོའོ།
en: This wheel cannot be demonstrated even slightly, for it is an inexpressible wheel.

source: །འཁོར་ལོ་དེ་ནི་སྒྲོགས་པ་ཆུང་ཟད་ཀྱང་མེད་དེ་བརྗོད་དུ་མེད་པའི་འཁོར་ལོའོ།
en: This wheel cannot be discussed even slightly, for it is an ineffable wheel.

source: །ཡང་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་དེ་ནི་སྟོང་པ་ཉིད་ཀྱི་སྒོ་ལ་གནས་པས་མཚན་མ་མེད་པའོ།
en: Also, this nonregressing wheel is free of marks because it rests in the gateway of emptiness.

source: །རྣམ་པར་གྲོལ་བའི་སྒོ་ལ་གནས་པས་མཚན་ཉིད་མེད་པའོ།
en: It is free of characteristics because it rests in the gateway of liberation.

source: །ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའི་ནམ་མཁའི་མཚན་ཉིད་དོ།
en: It has the characteristic of space because it accompanies everything.

source: །དེ་ཡང་དེའི་རྗེས་སུ་ཡང་དག་པར་སོང་བའི་རང་བཞིན་གྱི་མཚན་ཉིད་དེ།
en: It also has the characteristic of naturally accompanying everything.

source: དེ་བས་ན་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་ཞེས་བྱའོ།
en: Therefore, it is called the nonregressing wheel. “

source: །རིགས་ཀྱི་བུ་དག་རྡོ་རྗེའི་ཚིག་ནི་གང་ཆོས་ཐམས་ཅད་ངེས་པར་རྟོགས་པའོ།
en: Noble sons, the definite realization of all phenomena is a vajra word.

source: །ཡང་ཆོས་ཐམས་ཅད་ངེས་པར་རྟོགས་པ་གང་ཞེ་ན།
en: What is the definite realization of all phenomena?

source: རིགས་ཀྱི་བུ་དག་སྟོང་པ་ཉིད་ནི་རྡོ་རྗེའི་ཚིག་སྟེ། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་ངེས་པར་རྟོགས་པར་འགྱུར་རོ།
en: Noble sons, emptiness is a vajra word that brings definite realization of all aspects of views.

source: །རིགས་ཀྱི་བུ་དག་མཚན་མ་མེད་པ་ནི་རྡོ་རྗེའི་ཚིག་སྟེ། རྣམ་པར་རྟོག་པ་ཐམས་ཅད་ལས་འདའ་བར་འགྱུར་རོ།
en: Noble sons, the absence of marks is a vajra word that transcends all concepts.

source: །རིགས་ཀྱི་བུ་དག་སྨོན་པ་མེད་པ་ནི་རྡོ་རྗེའི་ཚིག་སྟེ། འགྲོ་བ་ཐམས་ཅད་ལས་འདའ་བར་འགྱུར་རོ།
en: Noble sons, the absence of wishes is a vajra word that transcends all migration.

source: །རིགས་ཀྱི་བུ་དག་ཆོས་ཀྱི་དབྱིངས་ནི་རྡོ་རྗེའི་ཚིག་སྟེ། སྣ་ཚོགས་ལས་འདའ་བར་འགྱུར་རོ།
en: Noble sons, the realm of phenomena is a vajra word that transcends multiplicity.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་ཉིད་ནི་རྡོ་རྗེའི་ཚིག་སྟེ། བདག་མེད་པར་འགྱུར་རོ།
en: Noble sons, suchness is a vajra word that indicates the absence of self.

source: །རིགས་ཀྱི་བུ་དག་འདོད་ཆགས་དང་བྲལ་བ་ནི་རྡོ་རྗེའི་ཚིག་སྟེ། འདོད་ཆགས་ཀྱི་རང་བཞིན་མེད་པར་འགྱུར་རོ།
en: Noble sons, freedom from desire is a vajra word that indicates how desire has no nature.

source: །རིགས་ཀྱི་བུ་དག་མྱ་ངན་ལས་འདས་པ་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: Noble sons, nirvāṇa is a vajra word that shows how phenomena have the nature of nirvāṇa.”

source: ཆོས་རྣམས་དེའི་རང་བཞིན་དུ་སྟོན་ཏོ་ཞེས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་མཚན་ཐོག་ཐག་ཏུ་ཆོས་རྒྱ་ཆེར་བཤད་པ་དང་། དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་ཏིང་ངེ་འཛིན་འོད་ཟེར་གྱི་མེ་ཏོག་ཅེས་བྱ་བ་མངོན་དུ་གྲུབ་པར་གྱུར་ཏེ།
en: Mañjuśrī Kumārabhūta expounded upon the Dharma to the bodhisattvas through the night, whereupon some bodhisattvas accomplished the absorption called the flower of light.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ནས་བ་སྤུའི་ཁུང་བུའི་འོད་ཟེར་རེ་རེ་ལས་ཀྱང་སངས་རྒྱས་བརྒྱ་སྟོང་སྟོན་ཅིང་།
en: As they rested in this bodhisattva absorption, light streamed from each of their pores, projecting hundreds of thousands of buddhas.
